{
  "projectId": "079b8944-e927-4695-a754-302124c6c13d",
  "revisionString": "1",
  "projectNameDisplay": "Pixel Art Purgatory: A Generative Soul-Searching Adventure",
  "userPromptForThisRevision": "Project Title: Pixel Art Purgatory: A Generative Soul-Searching Adventure\r\n\r\nApp Type Hint: Game\r\n\r\nImage Generation Mode: DALL-E 3 (Specify for clarity)\r\n\r\nTarget Style Preferences: Theme: dark, CSS Framework: bootstrap, JS Structure: vanilla\r\n\r\nApp Description:\r\n\r\nPixel Art Purgatory is a single-file HTML5 game/creative tool where the player navigates a procedurally generated pixel art purgatory, guided by cryptic AI-generated haiku prompts.  The purgatory is a shifting landscape of 8-bit sprites and environments, rendered using a custom pixel art engine. The player’s goal is to create pixel art interpretations of the haiku prompts, using a built-in pixel art editor. These creations directly affect the player's journey through purgatory – successful interpretations open new paths, unlock areas, and reveal story elements.  Failed attempts lead to increasingly bizarre and challenging obstacles.\r\n\r\n**Unique Mechanics:**\r\n\r\n*   **Haiku-Driven Narrative:** The /api/ai endpoint generates haiku prompts, each providing a vague, surreal, and emotionally evocative direction for the player's pixel art creation. The haiku’s tone and subject matter dictate the style and difficulty of the next level.\r\n*   **Procedural Generation:** The game environment is procedurally generated using a combination of algorithms and AI image generation.  DALL-E 3 creates initial landscape sketches in pixel art style based on the current haiku, then these are refined and expanded algorithmically to create playable levels.\r\n*   **AI-Judged Art:** The player's pixel art is evaluated by the /api/ai endpoint, not for technical perfection, but for its emotional resonance and thematic alignment with the corresponding haiku.  A scoring system based on semantic similarity and creative interpretation determines the player’s success.\r\n*   **Dynamic Difficulty:** The difficulty of the game adapts to the player’s skill.  Repeated failures may lead to more challenging levels and environments, introducing unexpected mechanics or enemies.  Success unlocks smoother pathways and potentially reveals hidden secrets and bonus content.\r\n*   **Interactive Pixel Art Editor:** The built-in pixel art editor should be intuitive and easy to use, allowing players to create and refine their pixel art based on their interpretation of the haiku prompt.  It should include tools for color selection, brush sizes, layers, and basic animation.\r\n\r\n\r\n**Wow Factor:** The game’s blend of procedural generation, AI-driven narrative, and player-created art results in a uniquely personalized and unpredictable experience.  Each playthrough is radically different, offering high replayability.  The contrast between the seemingly simple pixel art style and the surreal, emotionally charged haiku prompts creates an unexpected and compelling atmosphere. The user effectively creates their own path through purgatory by virtue of their artistic choices.",
  "basedOnRevisionString": null,
  "savedAt": "2025-05-21T15:49:55.436Z",
  "imageAssets": []
}