{
  "projectId": "6bac3d9e-1217-4f6f-b05b-bc664e2e95d3",
  "revisionString": "1",
  "projectNameDisplay": "Celestial Cartographer",
  "userPromptForThisRevision": "\r\n\r\nDetailed Description: Celestial Cartographer is an immersive educational RPG where players assume the role of apprentice cartographers charting the constellations for a celestial academy.  The game features a rich, dark-themed Bootstrap interface with a dynamic, parallax-scrolling star chart rendered on an HTML5 canvas. Players receive missions from the academy's headmaster (voiced by a sophisticated /api/ai generated narration), each mission focusing on a specific constellation.  Missions provide cryptic clues generated by the /api/ai endpoint, combining astronomical data, mythological hints, and even poetic verses to challenge players' deductive skills.  \r\n\r\nStar coordinates are presented as celestial coordinates alongside the clues, which are progressively more difficult as the player progresses through the ranks.  Successfully charting a constellation unlocks not only a high-resolution DALLE3 image of that constellation, showcasing its beauty and detail in stunning visual fidelity, but also rewards players with experience points and in-game currency (\"Cosmic Dust\").  This currency can be used to unlock new tools, such as enhanced star-tracking technology improving accuracy and providing further hints, or even purchase upgrades for the observatory, improving the quality and detail of the DALLE3 generated images.\r\n\r\nIncorrect mappings result in distorted or partially obscured images, accompanied by playful, insightful feedback from the /api/ai generated headmaster.  The observatory itself, visually represented within the game, dynamically upgrades based on player progress.  Furthermore, a personalized celestial atlas grows with each completed constellation, showcasing the player's achievements and providing a readily available resource for review.  Ambient space soundscapes dynamically adjust based on the player’s location within the game and the difficulty of the current mission, further enhancing the immersive experience.  The \"wow\" factor comes from the combination of challenging puzzles, RPG progression elements, stunning visuals from DALLE3, captivating narrative driven by /api/ai generated content, and a rewarding sense of accomplishment as players build their own celestial atlas, becoming masters of the night sky.",
  "basedOnRevisionString": null,
  "savedAt": "2025-05-22T15:59:39.615Z",
  "imageAssets": []
}