{
  "projectId": "892ec2fc-6179-412d-8791-274dc77c38c0",
  "revisionString": "3",
  "projectNameDisplay": "MetaMind Insights: Your AI-Powered Research Assistant",
  "userPromptForThisRevision": "THIS IS NOT A GAME!!! KEEP CORE STYLE AND FUNCTION\r\n\r\nPrompt for: MetaMind Insights: Your AI-Powered Research Assistant - Rev 2\r\n[2025-05-28T11:46:21.402Z] [ERROR] Fetch error: TypeError: Failed to fetch\r\n    at HTMLFormElement.handleSearchSubmit (https://beepboopbeepgen.replit.app/apps/892ec2fc-6179-412d-8791-274dc77c38c0_rev1.html:252:44)\r\n\r\nGuide for AI: Using the MetaMindsSearch Bing Search API\r\nObjective: To leverage the MetaMindsSearch Bing Search API to perform web searches and retrieve summarized, actionable information along with source URLs.\r\n1. API Endpoint:\r\nURL: http://MetaMindsSearch-dev.eba-q5t7qk5a.us-east-2.elasticbeanstalk.com/api/bing-search\r\n2. HTTP Method:\r\nAlways use the POST method when interacting with this endpoint.\r\n3. Headers:\r\nYou must include the following header in your request:\r\nContent-Type: application/json\r\n4. Request Body:\r\nYour request must contain a JSON object with a single key: query.\r\n\r\n\r\nThe value of query should be a string containing the search term or question you want to investigate.\r\n\r\n\r\nExample Request Body:\r\n\r\n JSON\r\n{\r\n  \"query\": \"What are the latest developments in renewable energy?\"\r\n}\r\n\r\n\r\n5. Response Structure:\r\nThe API will respond with a JSON object. If successful, it will contain the following keys:\r\n\r\n\r\nsearchQuery (string): This will be the original query you sent.\r\nsummary (string): A synthesized summary of the information found across multiple web pages visited. This is often generated by a large language model (like GPT-4o-mini) and aims to provide a concise overview of the key findings.\r\nsources (array): An array of objects, where each object represents a web page that was visited and used to generate the summary. Each source object contains:\r\ntitle (string): The title of the web page.\r\nurl (string): The direct URL of the source page.\r\nsnippet (string): A short extract or beginning of the content found on the page.\r\nExample Response Structure:\r\n\r\n JSON\r\n{\r\n  \"searchQuery\": \"What are the latest developments in renewable energy?\",\r\n  \"summary\": \"Recent developments in renewable energy focus on improved solar panel efficiency, advancements in grid-scale battery storage, and innovations in offshore wind turbine technology...\",\r\n  \"sources\": [\r\n    {\r\n      \"title\": \"Renewable Energy News Today | ScienceHub\",\r\n      \"url\": \"http://example-science.com/renewables\",\r\n      \"snippet\": \"Solar panel efficiency has seen a significant jump, with new perovskite-based cells showing promise...\"\r\n    },\r\n    {\r\n      \"title\": \"Future of Wind Power - Energy.gov\",\r\n      \"url\": \"http://example-gov.com/wind-power\",\r\n      \"snippet\": \"Offshore wind farms are becoming larger and more cost-effective, contributing significantly to green energy targets...\"\r\n    }\r\n  ]\r\n}\r\n\r\n\r\n6. How to Utilize:\r\nIdentify Information Need: Determine the topic or question you need to research.\r\nConstruct Request: Create the JSON payload with your query.\r\nSend Request: Execute an HTTP POST request to the specified URL with the correct headers and body.\r\nParse Response: Process the returned JSON data.\r\nUse Information:\r\nUse the summary to get a quick understanding of the topic.\r\nUse the sources array to:\r\nVerify the information presented in the summary.\r\nProvide attribution when presenting the information.\r\nNavigate for deeper investigation if required.\r\n\r\n",
  "basedOnRevisionString": "1",
  "savedAt": "2025-05-28T12:11:08.826Z",
  "imageAssets": []
}