{
  "projectId": "b08b50de-81d3-4dda-81cd-a3d32593d8ef",
  "revisionString": "3",
  "projectNameDisplay": "Statscan dashboard",
  "projectType": "webapp",
  "userPromptForThisRevision": "Introduction\r\n \r\nThe Statistics Canada SDMX REST web services provide access to the time series made available on the Statistics Canada’s website in a structured form. It complies with the SDMX standard. This service is accessible using an HTTP request.\r\nThe time series available through Statistics Canada’s Common Output Data Repository (CODR) are presented in a form of Canadian indicators/cubes (short-term, structural, specific, etc.) usually representing a set of series/vectors. An indicator/cube is broken down into as many elementary series as there are possible crossover of variables/dimensions. For example, 50 industries * 13 provinces/territories = 650 different series/vectors in CODR.\r\nThe SDMX web service allows access:\r\n- to the values of the series\r\n- structural metadata describing the characteristics of the series\r\n- is free of charge\r\nIt is possible to quickly extract data using the CODR cube identifier and vectors. In these cases the user must have previously noted the CODR cube identifier or vector identifier from the Statistics Canada website.\r\nWhat is SDMX?\r\n \r\nThe Statistical Data and Metadata Exchange initiative is sponsored by seven institutions (the Bank for International Settlements (BIS), the European Central Bank (ECB), Eurostat, the International Monetary Fund (IMF), the Organisation for Economic Co-operation and Development (OECD), the United Nations (UN) and the World Bank) to foster standards for the exchange of statistical information. The first version of the standard is an ISO standard (ISO/Technical Specification 17369:2005). It offers an information model for the representation of statistical data and metadata, as well as several formats to represent this model (SDMX-EDI, SDMX-JSON, SDMX-CSV and several SDMX-ML formats). It also proposes a standard way of implementing web services, including the use of registries.\r\n \r\nThe SDMX information model in a nutshell\r\nThe list below tells you everything you need to know about the SDMX information model in order for us to start developing an application based on the SDMX standard:\r\n• Descriptor concepts: In order to make sense of some statistical data, we need to know the concepts associated with them. For example, on its own the figure 1.3312 is pretty meaningless, but if we know that this is an exchange rate for the CDN dollar against the US dollar on November 19th, 2019, it starts to make more sense.\r\n• Packaging structure: Statistical data can be grouped together at the following levels: the observation level (the measurement of some phenomenon); the series level (the measurement of some phenomenon over time, usually at regular intervals); the group level (a group of series – a well-known example being the sibling group, a set of series which are identical, except for the fact that they are measured with different frequencies); and the dataset level (made up of several groups, to cover a specific statistical domain for instance). The descriptor concepts mentioned in point 1 can be attached at various levels in this hierarchy.\r\n• Dimensions and attributes: There are two types of descriptor concepts: dimensions, which both identify and describe the data, and attributes, which are purely descriptive.\r\n• Keys: Dimensions are grouped into keys, which allow the identification of a particular set of data (a series, for example). The key values are attached at the series level and given in a fixed sequence. Conventionally, frequency is the first descriptor concept and the other concepts are assigned an order for that particular dataset. Partial keys can be attached to groups.\r\n• Code lists: Every possible value for a dimension is defined in a code list. Each value on that list is given a language-independent abbreviation (code) and a language-specific description. Attributes are represented sometimes by codes, and sometimes by free-text values. Since the purpose of an attribute is solely to describe and not to identify the data, this is not a problem.\r\n• Data Structure Definitions: A Data Structure Definition (key family) specifies a set of concepts, which describe and identify a set of data. It tells us which concepts are dimensions (identification and description) and which are attributes (just description), and it gives the attachment level for each of these concepts on the basis of the packaging structure (dataset, group, series or observation), as well as their status (mandatory or conditional). It also specifies which code lists provide possible values for the dimensions and gives possible values for the attributes, either as code lists or free text fields.\r\nThe various SDMX-ML formats\r\nSDMX-ML supports various use cases and, therefore, defines several XML formats. For the purpose of this guide, the following two formats will be used:\r\n• The Structure Definition format : This format will be used to define the structure (concepts, code lists, dimensions, attributes, etc.) of the key families.\r\n• The Compact format: This format will be used to define the data file. It is not a generic format (it is specific to a Data Structure Definition), but it is designed to support validation and is much more compact so as to support the exchange of large datasets.\r\nThe SDMX information model is much richer than this limited introduction, however the above should be sufficient to understand the basics of this web service. For additional information, please refer to the SDMX documentation (SDMX.org).\r\n \r\nSDMX Data (cube) Web Service\r\n \r\nAll the data stored in CODR can be retrieved using the query string described below.\r\n​protocol://wsEntryPoint/resource/flowRef/key?parameters\r\n \r\n\r\nwhere parameters are defined as such:\r\nstartPeriod=value&endPeriod=value&firstNObservations=value&lastNObservations=value&detail=value\r\n \r\nSyntax definition\r\n \r\nprotocol\r\nThe web service is available over http and https.\r\nwsEntryPoint\r\nThe web service entry point is available at the same location of the sdmx data and metadata entry point.\r\nresource\r\nThe resource for queries is dataflow.\r\nflowRef\r\nA reference to the dataflow describing the data that needs to be returned.\r\nThe syntax is the identifier of the agency maintaining the dataflow, followed by the identifier of the dataflow, followed by the dataflow version, separated by a ,(comma).\r\nFor example: AGENCY_ID, FLOW_ID, VERSION\r\nIf the parameter contains only one of these 3 elements, it is considered to be the identifier of the dataflow. The value for the identifier of the agency maintaining the dataflow will default to all, while the value for the dataflow version will default to latest.\r\nIf the string contains only two of these 3 elements, they are considered to be the identifier of the agency maintaining the dataflow and the identifier of the dataflow. The value for the dataflow version will default to latest.\r\n \r\nkey\r\nThe combination of dimensions allows statistical data to be uniquely identified. Such a combination is known as a series key in SDMX and this is what is needed in the key parameter.\r\nLet's say for example that exchange rates can be uniquely identified by the following:\r\n• the frequency at which they are measured (e.g.: on a daily basis - code D),\r\n• the currency being measured (e.g.: US dollar - code USD),\r\n• the currency against which a currency is being measured (e.g.: Euro - code EUR),\r\n• the type of exchange rates (Foreign exchange reference rates - code SP00) and\r\n• the series variation (such as average or standardized measure for given frequency, code A).\r\nIn order to build the series key, you need to take the value for each of the dimensions (in the order in which the dimensions are defined in the DSD) and separate them with a .(dot). The series key for the example above therefore becomes: D.USD.EUR.SP00.A\r\nWildcarding is supported by omitting the value for the dimension to be wildcarded. For example, the following series key can be used to retrieve the data for all daily currencies against the euro: D..EUR.SP00.A\r\nThe OR operator is supported using the + (plus) character. For example, the following key can be used to retrieve the exchange rates against the euro for both the US dollar and the Japanese Yen: D.USD+JPY.EUR.SP00.A\r\nYou can of course combine wildcarding and the OR operator. For example, the following key can be used to retrieve daily or monthly exchange rates of any currency against the euro: D+M..EUR.SP00.A\r\nstartPeriod & endPeriod\r\nIt is possible to define a date range for which observations should be returned by using the startPeriod and/or endPeriod parameters. The values should be given according to the syntax defined in ISO 8601 or as SDMX reporting periods. The format will vary depending on the frequency.\r\nThe supported formats are:\r\n• YYYY for annual data (e.g.: 2013).\r\n• YYYY-MM for monthly data (e.g.: 2013-01).\r\n• YYYY-MM-DD for daily data (e.g.: 2013-01-01).\r\n \r\nDetail\r\nUsing the detail parameter, it is possible to specify the desired amount of information to be returned by the web service.\r\nPossible options are:\r\n• full: The data (series and observations) and the attributes will be returned. This is the default.\r\n \r\n \r\nfirstNObservations & lastNObservations\r\nUsing the firstNObservations and/or lastNObservations parameters, it is possible to specify the maximum number of observations to be returned for each of the matching series, starting from the first observation (firstNObservations) or counting back from the most recent observation (lastNObservations).\r\nExamples\r\n \r\n1. Retrieve the data for the series 1.1.1 (Canada / Both sexes / All ages) for the 17100005 dataflow. Table 17100005 is presented in full details in appendix 1.\r\n \r\n \r\nhttps://www150.statcan.gc.ca/t1/wds/sdmx/statcan/v1/rest/data/DF_17100005/1.1.1\r\n \r\n \r\nResults\r\nSDMX-ML 2.1 Generic Data\r\n\r\n\r\n\r\nSDMX-ML 2.1 Structure Specific Data\r\n\r\n\r\n\r\nSDMX-JSON\r\n\r\n\r\n\r\n \r\n2. Retrieve the data for the series 1.2+3.1 (Canada / Male & Female / All ages) for the 17100005 dataflow. Table 17100005 is presented in full details in appendix 1.\r\n \r\n \r\nhttps://www150.statcan.gc.ca/t1/wds/sdmx/statcan/v1/rest/data/DF_17100005/1.2+3.1\r\n \r\n \r\nResults\r\nSDMX-ML 2.1 Generic Data\r\n\r\n\r\n\r\nSDMX-ML 2.1 Structure Specific Data\r\n\r\n\r\n\r\nSDMX-JSON\r\n\r\n\r\n\r\n \r\n3. Retrieve the data for the series .1.138 (all geographies / Both sexes / 100 years and over) for the 17100005 dataflow and for the reference years 2015 & 2016. Table 17100005 is presented in full details in appendix 1.\r\n \r\n \r\nhttps://www150.statcan.gc.ca/t1/wds/sdmx/statcan/v1/rest/data/DF_17100005/.1.138?startPeriod=2015&endPeriod=2016\r\n \r\n \r\nResults\r\nSDMX-ML 2.1 Generic Data\r\n\r\n\r\n\r\nSDMX-ML 2.1 Structure Specific Data\r\n\r\n\r\n\r\nSDMX-JSON\r\n\r\n\r\n\r\n \r\n \r\nSDMX Data (vector) Web Service\r\n \r\nAll the data stored in CODR can be retrieved using the query string described below.\r\n​protocol://wsEntryPoint/resource/vector?parameters\r\n \r\n\r\nwhere parameters are defined as such:\r\nstartPeriod=value&endPeriod=value&firstNObservations=value&lastNObservations=value&detail=value\r\n \r\nSyntax definition\r\n \r\nprotocol\r\nThe web service is available over http and https.\r\nwsEntryPoint\r\nThe web service entry point is available at the same location of the sdmx data and metadata entry point.\r\nresource\r\nThe resource for vector queries is vector.\r\nvector\r\nThe vector allows statistical time series to be identified. Vectors are unique identifiers to a time series of data points. (i.e. v123456) They do not change over time. Given the vector number does not change, users can still use the same vectors as shortcuts to their data points of interest.\r\nstartPeriod & endPeriod\r\nIt is possible to define a date range for which observations should be returned by using the startPeriod and/or endPeriod parameters. The values should be given according to the syntax defined in ISO 8601 or as SDMX reporting periods. The format will vary depending on the frequency.\r\nThe supported formats are:\r\n• YYYY for annual data (e.g.: 2013).\r\n• YYYY-MM for monthly data (e.g.: 2013-01).\r\n• YYYY-MM-DD for daily data (e.g.: 2013-01-01).\r\n \r\nDetail\r\nUsing the detail parameter, it is possible to specify the desired amount of information to be returned by the web service.\r\nPossible options are:\r\n• full: The data (series and observations) and the attributes will be returned. This is the default.\r\n \r\n \r\nfirstNObservations & lastNObservations\r\nUsing the firstNObservations and/or lastNObservations parameters, it is possible to specify the maximum number of observations to be returned for each of the matching series, starting from the first observation (firstNObservations) or counting back from the most recent observation (lastNObservations).\r\nExamples\r\n \r\n4. Retrieve the data for the series (vectors) 466670 (Canada / Male / All ages). Table 17100005 is presented in full details in appendix 1.\r\n \r\n \r\nhttps://www150.statcan.gc.ca/t1/wds/sdmx/statcan/v1/rest/vector/v466670\r\n \r\n \r\nResults\r\nSDMX-ML 2.1 Generic Data\r\n\r\n\r\n\r\nSDMX-ML 2.1 Structure Specific Data\r\n\r\n\r\n\r\nSDMX-JSON\r\n\r\n\r\n\r\n \r\n \r\nSDMX Metadata (structure) Web Service\r\n \r\n5. Retrieve the latest version in production of the DSD with id 17100005 data structure. Table 17100005 is presented in full details in appendix 1.\r\n \r\n \r\nhttps://www150.statcan.gc.ca/t1/wds/sdmx/statcan/v1/rest/structure/Data_Structure_17100005\r\n \r\n \r\nResults\r\nSDMX-ML Structure format\r\n\r\n\r\n \r\n \r\n\r\nContent negotiation\r\n \r\nUsing the HTTP content negotiation mechanism, you can select the representation to be returned and you can also instruct the service to compress the data to be returned.\r\nFormat selection\r\nThe following data formats are supported by the web service:\r\n• Data formats:\r\no SDMX-ML 2.1 Generic Data format: application/vnd.sdmx.genericdata+xml;version=2.1. This is the default for data queries.\r\no SDMX-ML 2.1 Structure Specific Data format: application/vnd.sdmx.structurespecificdata+xml;version=2.1\r\no SDMX-JSON: application/vnd.sdmx.data+json;version=1.0.0-wd\r\no CSV: text/csv\r\n• Metadata formats:\r\no SDMX-ML Structure format: application/vnd.sdmx.structure+xml;version=2.1\r\nFor additional information about the various SDMX-ML formats, please refer to the SDMX documentation.\r\n\r\nGeneric mime types (application/json, application/xml) are also supported but they will always point to the most recent version of the SDMX formats supported by these web services. That version will change in the future, whenever new versions of the various SDMX formats are made available.\r\n\r\n \r\nIs it therefore highly recommended that implementers use one of the specific mime types above rather than a generic one, to avoid issues when new versions of the formats are released.\r\n \r\nOutput compression\r\nYou can also enable data compression using the Accept-Encoding HTTP header field. Compressed messages are typically significantly smaller than uncompressed messages, which can lead to improvements when transferring large amount data over the network.\r\n \r\nStatus codes\r\nThe web service returns the following HTTP status codes.\r\n\r\nCode\r\n\r\nStatus\r\n\r\nDescription\r\n\r\n200\r\n\r\nOK\r\n\r\nYour query could be successfully processed and the data have been returned.\r\n\r\n304\r\n\r\nNo changes\r\n\r\nNo changes since the timestamp supplied in the If-Modified-Since header.\r\n\r\n400\r\n\r\nSyntax error\r\n\r\nIf there is a syntactic or semantic issue with the parameters you supplied, a 400 HTTP status code will be returned.\r\n\r\n404\r\n\r\nNo results found\r\n\r\nA 404 HTTP status code will be returned if there are no results matching the query.\r\n\r\n406\r\n\r\nNot Acceptable\r\n\r\nIf you ask for a resource representation that we don't support, a 406 HTTP status code will be returned. See the section about content negotiation, to view the supported representations.\r\n\r\n500\r\n\r\nInternal Server Error\r\n\r\nWhen there is an issue on our side, a 500 HTTP status code will be returned. Feel free to try again later or to contact our support hotline.\r\n\r\n501\r\n\r\nNot implemented\r\n\r\nThis web service offers a subset of the functionality offered by the SDMX RESTful web service specification. When you use a feature that we have not yet implemented, a 501 HTTP status code will be returned.\r\n\r\n503\r\n\r\nService unavailable\r\n\r\nIf our web service is temporarily unavailable, a 503 HTTP status code will be returned.\r\n\r\n \r\n \r\nUseful tips\r\nThe SDMX Technical Working Group publishes a list of tips and tricks for web service clients, which is well worth reading.\r\n\r\nThe SDMX Technical Working Group has also published a cheatsheet which summarises, in 2 A4 pages, the main points of the SDMX 2.1 RESTful API.\r\n\r\nIf the documentation does not contain the information you require, or if you have any general comments or feedback regarding our web service, please contact us.\r\n\r\nAll sample queries in this tutorial can also be executed using command-line tools such as curl or wget:\r\n\r\nwget -O data.xml \\\r\n--header=\"Accept:application/vnd.sdmx.structurespecificdata+xml;version=2.1\" \\\r\nhttps://sdw-wsrest.ecb.europa.eu/service/data/EXR/M.NOK.EUR.SP00.A\r\ncurl -k -o data.xml \\\r\n--header \"Accept:application/vnd.sdmx.structurespecificdata+xml;version=2.1\" \\\r\nhttps://sdw-wsrest.ecb.europa.eu/service/data/EXR/M.NOK.EUR.SP00.A\r\n \r\n\f\r\nAppendix 1\r\nTable 17100005 - Population estimates on July 1st, by age and sex\r\n\r\n \r\n1st Dimension - Geography\r\nCode\r\nName_en\r\n1\r\nCanada\r\n2\r\nNewfoundland and Labrador\r\n3\r\nPrince Edward Island\r\n4\r\nNova Scotia\r\n5\r\nNew Brunswick\r\n6\r\nQuebec\r\n7\r\nOntario\r\n8\r\nManitoba\r\n9\r\nSaskatchewan\r\n10\r\nAlberta\r\n11\r\nBritish Columbia\r\n12\r\nYukon\r\n13\r\nNorthwest Territories including Nunavut\r\n14\r\nNorthwest Territories\r\n15\r\nNunavut\r\n \r\n2nd Dimension – Sex\r\nCode\r\nName_en\r\n1\r\nBoth sexes\r\n2\r\nMales\r\n3\r\nFemales\r\n \r\n3rd Dimension – Age group\r\nCode\r\nName_en\r\n1\r\nAll ages\r\n2\r\n0 years\r\n3\r\n1 year\r\n4\r\n2 years\r\n5\r\n3 years\r\n6\r\n4 years\r\n7\r\n0 to 4 years\r\n8\r\n5 years\r\n9\r\n6 years\r\n10\r\n7 years\r\n11\r\n8 years\r\n12\r\n9 years\r\n13\r\n5 to 9 years\r\n14\r\n10 years\r\n15\r\n11 years\r\n16\r\n12 years\r\n17\r\n13 years\r\n18\r\n14 years\r\n19\r\n10 to 14 years\r\n20\r\n15 years\r\n21\r\n16 years\r\n22\r\n17 years\r\n23\r\n18 years\r\n24\r\n19 years\r\n25\r\n15 to 19 years\r\n26\r\n20 years\r\n27\r\n21 years\r\n28\r\n22 years\r\n29\r\n23 years\r\n30\r\n24 years\r\n31\r\n20 to 24 years\r\n32\r\n25 years\r\n33\r\n26 years\r\n34\r\n27 years\r\n35\r\n28 years\r\n36\r\n29 years\r\n37\r\n25 to 29 years\r\n38\r\n30 years\r\n39\r\n31 years\r\n40\r\n32 years\r\n41\r\n33 years\r\n42\r\n34 years\r\n43\r\n30 to 34 years\r\n44\r\n35 years\r\n45\r\n36 years\r\n46\r\n37 years\r\n47\r\n38 years\r\n48\r\n39 years\r\n49\r\n35 to 39 years\r\n50\r\n40 years\r\n51\r\n41 years\r\n52\r\n42 years\r\n53\r\n43 years\r\n54\r\n44 years\r\n55\r\n40 to 44 years\r\n56\r\n45 years\r\n57\r\n46 years\r\n58\r\n47 years\r\n59\r\n48 years\r\n60\r\n49 years\r\n61\r\n45 to 49 years\r\n62\r\n50 years\r\n63\r\n51 years\r\n64\r\n52 years\r\n65\r\n53 years\r\n66\r\n54 years\r\n67\r\n50 to 54 years\r\n68\r\n55 years\r\n69\r\n56 years\r\n70\r\n57 years\r\n71\r\n58 years\r\n72\r\n59 years\r\n73\r\n55 to 59 years\r\n74\r\n60 years\r\n75\r\n61 years\r\n76\r\n62 years\r\n77\r\n63 years\r\n78\r\n64 years\r\n79\r\n60 to 64 years\r\n80\r\n65 years\r\n81\r\n66 years\r\n82\r\n67 years\r\n83\r\n68 years\r\n84\r\n69 years\r\n85\r\n65 to 69 years\r\n86\r\n70 to 74 years\r\n87\r\n75 to 79 years\r\n88\r\n80 to 84 years\r\n89\r\n85 to 89 years\r\n90\r\n90 years and over\r\n91\r\n0 to 14 years\r\n92\r\n0 to 15 years\r\n93\r\n0 to 16 years\r\n94\r\n0 to 17 years\r\n95\r\n15 to 49 years\r\n96\r\n15 to 64 years\r\n97\r\n16 to 64 years\r\n98\r\n17 to 64 years\r\n99\r\n18 to 24 years\r\n100\r\n18 to 64 years\r\n101\r\n18 years and over\r\n102\r\n25 to 44 years\r\n103\r\n45 to 64 years\r\n104\r\n65 years and over\r\n105\r\nMedian age\r\n106\r\n70 years\r\n107\r\n71 years\r\n108\r\n72 years\r\n109\r\n73 years\r\n110\r\n74 years\r\n111\r\n75 years\r\n112\r\n76 years\r\n113\r\n77 years\r\n114\r\n78 years\r\n115\r\n79 years\r\n116\r\n80 years\r\n117\r\n81 years\r\n118\r\n82 years\r\n119\r\n83 years\r\n120\r\n84 years\r\n121\r\n85 years\r\n122\r\n86 years\r\n123\r\n87 years\r\n124\r\n88 years\r\n125\r\n89 years\r\n126\r\n90 to 94 years\r\n127\r\n90 years\r\n128\r\n91 years\r\n129\r\n92 years\r\n130\r\n93 years\r\n131\r\n94 years\r\n132\r\n95 to 99 years\r\n133\r\n95 years\r\n134\r\n96 years\r\n135\r\n97 years\r\n136\r\n98 years\r\n137\r\n99 years\r\n138\r\n100 years and over\r\n",
  "basedOnRevisionString": "2",
  "savedAt": "2025-05-30T15:22:24.316Z",
  "imageAssets": []
}